       program-id. COBOL1 as "COBOL1".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.


           goback.

       end program COBOL1.
       
       Name: Jennifer Olenic
       Section: 20F_CST8283_450
       ID: 040998261
       
